{
	"title": "Web Projects",
	"cards": [
		{
			"category": "Browser Extensions",
			"title": "MESH",
			"icons": [
				{"fabid": "chrome"},
				{"fabid": "js"}
			],
			"image": "/images/mesh.png",
			"body": [
				{"paragraph": "MESH was a chrome extension which allowed users to selectively block ads from brands / companies they disliked while allowing ads from brands they loved."}
			]
		},
		{
			"category": "Machine Learning",
			"title": "Gumby",
			"icons": [
				{"fabid": "python"}
			],
			"image": "/images/gumby.jpg",
			"body": [
				{"paragraph": "Python based backend application which used Natural Language Processing techniques to categorize blocks of text automatically."}
			]
		},
		{
			"category": "Site Analysis & Reporting",
			"title": "Data Reporting Engine",
			"image": "/images/dre.png",
			"icons": [
				{"fabid": "python"}
			],
			"body": [
				{"paragraph": "The data reporting engine was responsible for capturing data from a variety of different sources and reporting it to clients, employees and to other external sources. The engine was designed to be very flexible in order to specifically cater to changing business needs."}
			]
		},
		{
			"category": "Site Content Auditing & Authoring",
			"title": "The Content Tool",
			"icons": [
				{"fabid": "php"}
			],
			"image": "/images/content-tool.png",
			"body": [
				{"paragraph": "The content tool was designed to assist employees with site planning and content strategy efforts for clients. The tool worked in conjunction with other projects (Gumby, Hogna and the Data Reporting Engine) to crawl, analyze, catalog, and edit / author site content. The tool also contained versioning, device emulation (with screenshots at different resolutions) and project planning features."}
			]
		},
		{
			"category": "Team Development Environments",
			"title": "DevStack",
			"icons": [
				{"fabid": "php"},
				{"fabid": "js"}
			],
			"image": "/images/devstack.png",
			"body": [
				{"paragraph": "Powered by vagrant and salt stack, DevStack was an internal tool used to mimic our production environment to other developers who were not used to working on their own copy of the code. It came with a web interface that let them choose technologies needed for each project which were later saved to a JSON file that lived with the source code."}
			]
		},
		{
			"category": "Video Websites",
			"title": "Curative Groove",
			"icons": [
				{"fabid": "js"}
			],
			"image": "/images/curativegroove.png",
			"body": [
				{"paragraph": "Chalaina is a therapist who wanted to speak directly to her site visitors via an interactive video tour of her private practice."}
			]
		},
		{
			"category": "Web Analytics & Client Portals",
			"title": "EngineRoom",
			"icons": [
				{"fabid": "php"},
				{"fabid": "js"}
			],
			"image": "/images/dashboard.png",
			"body": [
				{"paragraph": "Before Google Analytics was released, EngineRoom reported web analytics information to its clients in a simple manner. EngineRoom performed its own tracking and analysis by way of embedded JavaScript and a proxy for paid advertising campaigns. Clients were able to speak directly to account representatives via the web interface."}
			]
		},
		{
			"category": "Web Crawling",
			"title": "Hogna",
			"icons": [
				{"fabid": "python"}
			],
			"image": "/images/hogna.jpg",
			"body": [
				{"paragraph": "A versatile web crawler used for the analysis and inventorying of client site content."}
			]
		},
		{
			"category": "Web Proxies",
			"title": "Naga",
			"icons": [
				{"fabid": "python"}
			],
			"image": "/images/naga.jpg",
			"body": [
				{"paragraph": "An anonymizing HTTP proxy with IP rotating capabilities."}
			]
		}
	]
}